/*
 * Copyright (c) 2004 Apple Computer, Inc. All rights reserved.
 *
 * @APPLE_LICENSE_HEADER_START@
 * 
 * This file contains Original Code and/or Modifications of Original Code
 * as defined in and that are subject to the Apple Public Source License
 * Version 2.0 (the 'License'). You may not use this file except in
 * compliance with the License. Please obtain a copy of the License at
 * http://www.opensource.apple.com/apsl/ and read it before using this
 * file.
 * 
 * The Original Code and all software distributed under the License are
 * distributed on an 'AS IS' basis, WITHOUT WARRANTY OF ANY KIND, EITHER
 * EXPRESS OR IMPLIED, AND APPLE HEREBY DISCLAIMS ALL SUCH WARRANTIES,
 * INCLUDING WITHOUT LIMITATION, ANY WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE, QUIET ENJOYMENT OR NON-INFRINGEMENT.
 * Please see the License for the specific language governing rights and
 * limitations under the License.
 * 
 * @APPLE_LICENSE_HEADER_END@
 */

/*
 * Localizable.strings file for the webdav_cert_ui application bundle
 *
 * The webdav_cert_ui application is used by the WebDAV file system to display
 * the Certificate Trust Panel when the server has a certificate is not trusted for
 * some reason (expired, invalid, not yet valid, or unknown certifying authority).
 */

/*
 * These strings tell the user why the certificate for the WebDAV server is
 * not trusted, gives the name of the WebDAV server host, and asks the user if
 * they'd like to continue to connect or cancel. The marker (%@) will be replaced
 * by the server's host name (i.e. www.apple.com).
 */
"MESSAGE_CERT_EXPIRED" = "The certificate for this WebDAV server has expired. You might be connecting to a WebDAV server that is pretending to be “%@” which could put your confidential information at risk. Would you like to connect to the WebDAV server anyway?";
"MESSAGE_CERT_INVALID" = "The certificate for this WebDAV server is invalid. You might be connecting to a WebDAV server that is pretending to be “%@” which could put your confidential information at risk. Would you like to connect to the WebDAV server anyway?";
"MESSAGE_CERT_NOT_YET_VALID" = "The certificate for this WebDAV server is not yet valid. You might be connecting to a WebDAV server that is pretending to be “%@” which could put your confidential information at risk. Would you like to connect to the WebDAV server anyway?";
"MESSAGE_CERT_UNKNOWN_AUTHORITY" = "The certificate for this WebDAV server was signed by an unknown certifying authority. You might be connecting to a WebDAV server that is pretending to be “%@” which could put your confidential information at risk. Would you like to connect to the WebDAV server anyway?";
/* The title for the "Cancel" button */
"MESSAGE_CERT_CANCEL" = "Cancel";
/* The title for the "Continue" button */
"MESSAGE_CERT_CONTINUE" = "Continue";
